#  ———————————————————————————————————————————————————————————————————————————
#  Tell Homebrew what to do when we run `brew bundle`
#  ———————————————————————————————————————————————————————————————————————————

# CLI tools
brew "gh"
brew "ffmpeg"
brew "node"
brew "python@3.13"
brew "rust"
brew "wget"
brew "yt-dlp"
brew "go"
brew "openjdk"
brew "bat"
brew "pnpm"
brew "jq"
brew "lazygit"
brew "just"
brew "neovim"
brew "starship"
brew "tmux"
brew "tree"
brew "mosh"
brew "docker"
brew "docker-completion"
brew "weechat"
brew "irssi"
brew "emacs"
brew "spicetify-cli"
brew "spotify_player"
brew "yabai"
brew "skhd"
brew "fzf"
brew "screenresolution"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Necessities 
cask "iterm2"
cask "firefox@nightly"
cask "visual-studio-code"
cask "parsec"
cask "mullvadvpn"
cask "mtmr"
cask "halloy"
cask "google-chrome"
cask "libreoffice"
cask "qbittorrent"
cask "fx-cast-bridge"
cask "wine-stable"

# Audio/video
cask "audio-hijack"
cask "loopback"
cask "handbrake"
cask "obs"
cask "vlc"
cask "stolendata-mpv"
cask "spotify"

# Entertainment
cask "discord"
cask "steam"
cask "virtualdj"
cask "crossover"
